In [1]:
import pandas as pd

# Index Objects in Pandas

In [4]:
labels = list('abcde')
data = pd.Series([12,41,5125,124,123],index=labels)
data

a      12
b      41
c    5125
d     124
e     123
dtype: int64

## Index is immutable <br>
Lets See

In [5]:
data.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [6]:
data.index[0]

'a'

In [7]:
data.index[0] = 'f'

TypeError: Index does not support mutable operations

# Pandas fills the empty values using Nan <br>
Lets See

In [8]:
data_dict = {'names':['vikas','akash','kaash','raash'],
            'marks':[50,55,20,30],
            'salary':[100,200,150,105]}
data_dict

{'names': ['vikas', 'akash', 'kaash', 'raash'],
 'marks': [50, 55, 20, 30],
 'salary': [100, 200, 150, 105]}

In [9]:
data2 = pd.DataFrame(data_dict)
data2

   names  marks  salary
0  vikas     50     100
1  akash     55     200
2  kaash     20     150
3  raash     30     105

In [12]:
data2.set_index('names',inplace=True)
data2

       marks  salary
names
vikas     50     100
akash     55     200
kaash     20     150
raash     30     105

In [16]:
grades = ['a','b']
data2['grades'] = pd.Series(grades,index = ['vikas','kaash'])
data2

       marks  salary grades
names
vikas     50     100      a
akash     55     200    NaN
kaash     20     150      b
raash     30     105    NaN